[
  {
    "title": "Аналитик данных",
    "url": "https://www.superjob.ru/vakansii/analitik-dannyh-44488229.html",
    "salary": 0,
    "description": "<p>Сбер разрабатывает современные IT-решения для развития бизнеса. Наше IT-комьюнити стремительно расширяется и в таком же темпе мы ищем новые таланты.</p><p>Приглашаем в команду аналитика данных. Если тебе интересно это направление, и ты хочешь участвовать в запуске крутых проектов в масштабе страны, откликайся!</p><p><b>Тебе предстоит:</b></p><ul><li>искать и анализировать данные из разных источников, разрабатывать математические модели</li><li>визуализировать и интерпретировать полученные результаты анализа</li><li>проверять гипотезы на данных и обрабатывать ad-hoc запросы</li><li>участвовать в совершенствовании системы отчетности</li><li>проводить аналитические исследования</li></ul><p><b>Мы ждем от тебя:</b></p><ul><li>высшее техническое или экономическое образование</li><li>опыт анализа больших объемов данных, построения моделей, прогнозирования на будущие периоды</li><li>знание математической статистики и методов статистического анализа данных</li><li>опыт автоматизации или оптимизации процессов</li><li>опыт работы с СУБД: Teradata или Oracle или Greenplum, языками программирования: SQL и Python, с Power BI/Сonfluence/QLIK Sense/Visio</li></ul><p><b>Мы предлагаем:</b></p><ul><li>стабильный оклад и социальную поддержку сотрудников</li><li>официальное оформление с первого дня</li><li>мощное оборудование за счет компании</li><li>работу бок о бок лучшими из IT-индустрии, каждый из которых может поделиться своей экспертизой</li><li>митапы внутри компании, участие в крупнейших конференциях</li><li>обучение в одном из лучших Корпоративных университетов и в Виртуальной школе Сбера</li><li>современный офис с тихими местами для работы и зонами релаксации и спортзалом</li><li>корпоративный спортзал прямо в офисе</li><li>расширенный ДМС с первого дня для сотрудников и льготное страхование для близких корпоративную пенсионную программу</li><li>ипотеку ниже на 4% для каждого сотрудника</li><li>бесплатную подписку СберПрайм+ и скидки на продукты компаний-партнеров.</li></ul>"
  },
  {
    "title": "Специалист службы поддержки (Яндекс.Поиск)",
    "url": "https://engels.superjob.ru/vakansii/specialist-sluzhby-podderzhki-45402547.html",
    "salary": 15000,
    "description": "<p>Каждый день миллионы пользователей задают вопросы и находят ответы в Яндекс Поиске. А если что-то идёт не так, они могут обратиться в службу поддержки.</p><p>Мы ищем внимательных, тактичных и любознательных специалистов, которые будут помогать пользователям в самых разных ситуациях.</p><p><b>Что нужно делать:</b></p><p></p><ul><li>отвечать на сообщения пользователей по почте и в чатах;</li><li>консультировать по вопросам, связанным с Поиском;</li><li>передавать информацию разработчикам и менеджерам, чтобы они улучшали сервис.</li></ul><p><b>Мы ждём, что вы:</b></p><p></p><ul><li>грамотно пишете по-русски;</li><li>чётко и структурированно излагаете мысли;</li><li>умеете работать с большим объёмом информации;</li><li>ответственны, стрессоустойчивы, самоорганизованны;</li><li>умеете работать самостоятельно и в команде;</li><li>готовы учиться;</li><li>не устаёте от однообразных задач.</li></ul><p><b>Будет плюсом, если вы:</b></p><p></p><ul><li>можете читать языки JavaScript, HTML и Python;</li><li>имеете высшее или неоконченное высшее образование (особенно техническое).</li></ul><p><b>Условия:</b></p><p></p><ul><li>удалённая работа;</li><li>оформление совместительства;</li><li>сдельную оплату, зависящую от количества и сложности задач, которые вы выполните в течение месяца. В среднем — от 15000 рублей в месяц при работе 20 часов в неделю и от 30000 рублей в месяц при работе 40 часов в неделю. Премия по итогам месяца до 30 процентов;</li><li>два варианта оформления: </li><li>1.частичная занятость (работа по совместительству) — 5 дней в неделю по 4 часа, можно совмещать с учебой или другой работой; </li><li>2.полная занятость (основное место работы) — 5 дней в неделю по 8 часов;</li><li>гибкий график: плавающие выходные, начало смен обсуждается индивидуально;</li><li>удалённое оплачиваемое обучение.</li></ul>"
  },
  {
    "title": "Сетевой инженер",
    "url": "https://yaroslavl.superjob.ru/vakansii/setevoj-inzhener-46360275.html",
    "salary": 0,
    "description": "<p>Наша команда каждый день работает над повышением качества связи и отвечает за стабильный сервис для тебя. Профессионалы билайна уверенно создают надежную связь по всей территории нашей страны: в небольших поселках и крупных городах, на вершинах гор и под землей.</p> <p>Если ты готов решать сложные и масштабные задачи в команде экспертов — мы ждем твое резюме!</p> <p><b>Итак, тебе предстоит:</b></p> <ul><li> <p>Удаленное администрирование оборудования связи сети ШПД;</p> </li> <li> <p>Поддержка актуального программного обеспечения;</p> </li> <li> <p>Проведение плановых и аварийных работ в рамках развития и эксплуатации сети ШПД;</p> </li> <li> <p>Приемка объектов связи в эксплуатацию.</p> </li> </ul><p><b>Мы будем рады рассмотреть твою кандидатуру, если у тебя есть:</b></p> <ul><li>Понимание: модели OSI, принципов работы коммутатора L2, принципов работы маршрутизаторов L3;</li> <li>Наличие сертификатов: CCNA или аналогичный, CCNP или аналогичный;</li> <li>Хороший уровень знаний в области видов архитектурных стандартов моделей сетей;</li> <li>Базовые знания: Unix или Linux / базовые знания программирования - написание скриптов автоматизации (bash, perl, python);</li> <li>Знания в области сетевой безопасности и разграничения доступа - чтение и формирование ACL;</li> <li>Знания сетевых протоколов: RIP, OSPF, MPLS, STP, BGP, IGMP, PIM, SNMP.</li> </ul>"
  },
  {
    "title": "Учитель по программированию",
    "url": "https://andreevka.superjob.ru/vakansii/uchitel-po-programmirovaniyu-45698480.html",
    "salary": 0,
    "description": "<b>Обязанности:</b><ul><li><p>Обучение детей (4-14 лет) в группах программированию     </p></li><li><p>Формирование у учеников логического системного мышления и развитие технических творческих способностей  <br /></p></li><li>Обучение детей основам проектной работы в IT</li><li>\nПоддержание интереса и мотивации учеников\n\n  </li></ul><b>Требования:</b><ul><li><p>Опыт работы с детьми (аниматор, репетитор, воспитатель, вожатый,\nучитель, опытный родитель или старший брат/сестра</p></li><li>Уверенное владение компьютером. В идеале, знание основ алгоритмического языка и программирования. (Предпочтительно: Scratch JR, Scratch, Snap, Stencyl, Tynker, Blockly, Перволого, Пиктомир)</li><li>Умение объяснять сложное простыми (иногда детскими) словами\n\n</li><li>Любовь к детям и умение направить их энергию в нужное русло  <br /></li><li>Знание текстовых языков программирования Python, Java и прочее - желательно  <br /></li></ul><b>Условия:</b><ul><li><p>Удобный график (очень многое можно скорректировать совместно с\nадминистратором) </p></li><li>Возможность обучать мотивированных детей, которые стремятся узнать все о современных технологиях и не только  </li><li>Увлеченная команда преподавателей  <br /></li><li> Интересные и амбициозные задачи</li><li> Профессия квалифицированного детского IT тренера - одна из самых востребованных на рынке труда\n\n <br /></li></ul>"
  },
  {
    "title": "Аналитик",
    "url": "https://dolgoprudniy.superjob.ru/vakansii/analitik-45733204.html",
    "salary": 150000,
    "description": "<p><b>Перечень задач:</b></p><ul><li>Организация доступности информации для оперативного/тактического/стратегического управления. Проектирование и разработка витрин данных</li><li>Разработка аналитической отчетности.</li><li>Разработка дашбордов для оперативного и стратегического управления.</li></ul><p><b>Управленческие компетенции:</b></p><ul><li>Желательно:</li></ul><ol><li>Опыт управление проектом/ управление продуктом в областях:</li></ol><ul><li>Управленческая отчетность</li><li>Учетные системы</li><li>Витрины данных</li><li>BI системы</li></ul><p><b>Технические компетенции:</b></p><ul><li>BI инструменты и инструменты подготовки данных</li><li>Python/Jupiter Notebook</li><li>Apache Airflow</li><li>Google Sheet + Apps Script</li><li>Excel</li><li>Системы для управления связками между сервисами (например N8N)</li><li>Базы данных</li><li>Математика на здоровом уровне</li><li>Эстетический вкус в визуализация и презентации данных</li><li>Способность задавать вопросы, структурировать и систематизировать.</li></ul><b>Условия:</b><br /><ul><li>График работы с понедельника - по пятницу, с 8:00 - 17:00 (09:00 до 18:00)</li><li>Соблюдение трудового законодательства (официальное оформление с первого рабочего дня, \"белая\" заработная плата, оплачиваемые отпуска и больничные);</li><li>Стабильный рост заработной платы.</li><li>Корпоративные подарки от Компании на рождение ребенка, на 23 февраля. Новогодние подарки детям сотрудников.</li><li>Корпоративные скидки на нашу продукцию.</li></ul>"
  },
  {
    "title": "Преподаватель курса-Python для анализа данных",
    "url": "https://www.superjob.ru/vakansii/prepodavatel-kursa-python-dlya-analiza-dannyh-46280736.html",
    "salary": 0,
    "description": "<p>Обязанности:</p><ul><li>Ведение занятий в рамках программы</li></ul>Требования:<ul><li>Знать программирования на языке Python</li><li>Знать классы, библиотеки и функции Python для анализа и визуализации данных</li><li>Владеть методами программирования на языке Python</li><li>Уметь объединять данные из разных источников</li></ul>Условия:<ul><li>частичная занятость</li><li>Чтение лекций с пн-пт 9:00-14:00 или 14:05-19:00! ДИСТАНЦИОННО!</li></ul></p>"
  },
  {
    "title": "Data Scientist",
    "url": "https://lipetsk.superjob.ru/vakansii/data-scientist-46185194.html",
    "salary": 0,
    "description": "<p><b>Обязанности:</b></p><ul><li>Использовать алгоритмы машинного обучения для решения бизнес-задач </li><li>Исследовать данные с целью получения новых признаков </li><li>Разрабатывать требования для сбора данных, дизайн A/B тестов </li><li>Заниматься написанием эффективного кода для получения агрегатов данных </li><li>Развивать инфраструктуру для автоматического построения и использования моделей машинного обучения </li></ul><b>Требования:</b><ul><li>Высшее техническое образование </li><li>Уверенное знание SQL и готовность писать эффективные запросы</li><li>Уверенное владение Python (библиотеки работы с данными)</li><li>Опыт использования и внедрения алгоритмов машинного обучения</li><li>Знание базовых алгоритмов и структур данных, понимание плюсов и минусов </li><li>Уверенное знание математической статистики, умение применять для решения задач </li><li>Технический английский на уровне чтения статей и участия в конференциях </li></ul><b>Условия:</b><ul><li>формат работы;</li><li>График работы: 5/2; 8.00-17.00, 9.00-18.00 или 10.00-19.00 (на выбор);</li><li>Полугодовой бонус;</li><li>ДМС - после испытательного срока;</li><li>Дисконтная карта на продукцию 30% магазинов сети + корпоративные скидки и специальные условия от партнеров;</li><li>Обучение - доступно внутреннее и внешнее обучение, проводим внутренние митапы, техтолки, посещаем профильные конференции;</li><li>Некоторые бонусы предоставляются по принципу \"кафетерия\". Расскажем об этом подробнее при первом контакте.</li></ul>"
  },
  {
    "title": "Программист C (Linux)",
    "url": "https://spb.superjob.ru/vakansii/programmist-c-46363137.html",
    "salary": 200000,
    "description": "<p>ОАО \"СУПЕРТЕЛ\" - уникальное Российское предприятие, которое самостоятельно разрабатывает и производит современное оборудование проводной (оптической) связи по технологиям OTN, IP, SDH, DWDM; на сегодня в производстве находится порядка 20 типов оборудования. </p><p>Для участия в разработке нового оборудования неспешно ищем опытного программиста.\n\nЕсли Вы оцениваете свой уровень знаний/способностей выше, чем middle, не боитесь сложных задач и Вам нравится программировать на низком уровне (pure C) - будем рады пообщаться с Вами, даже если Ваш опыт отличается от требуемого для этой вакансии.</p><p>Указанный опыт работы - более 6 лет - очень грубый формальный фильтр, от него возможны существенные отклонения. </p><p>Знание \"в принципе\" других языков программирования подразумевается по умолчанию; основная цель - уметь применить shell/python/perl/sql/etc.. в нужное время и в нужном месте.<b><br /></b></p><b>Обязанности:</b><ul><li>Разработка системного и прикладного ПО (Embedded Linux) для телекоммуникационного оборудования  </li><li>Сопровождение и отладка разработанного ПО</li><li>Участие в разработке современного и перспективного оборудования проводной (оптической) связи<br /></li></ul><b>Требования:</b><ul><li>Желание и умение самостоятельно решать сложные задачи </li><li> Разработка многопоточных приложений и понимание применения объектов синхронизации (mutex, semaphores, etc.) </li><li> Умение разбираться в чужом коде </li><li> Опыт разработки на C не менее 3-х лет </li><li> Знание средств разработки и отладки (gcc, gdb, Makefile, CMake, Shell scripting, etc.) </li><li> Знание систем контроля версий git или mercurial </li><li> Чтение технической документации на английском языке</li></ul><b></b><p><b>Мы предлагаем:</b><br /></p><ul><li>Сложную и интересную работу с использованием передовых технологий     </li><li>Адекватную \"белую\" заработную плату (уточняется в зависимости от Ваших знаний и опыта по результатам собеседования) </li><li>Оформление по трудовому кодексу </li><li>Уютный офис в центре города </li><li> Карьерный и профессиональный рост</li><li>Полис ДМС + льготное страхование для членов семьи</li></ul><p>Для Вас будет дополнительным преимуществом: <br /></p><ul><li>Умение писать код с минимальной избыточностью </li><li>Опыт разработки драйверов для Linux </li><li>Опыт работы с системой сборки Yocto/OpenEmbedded </li><li>Опыт работы с процессорами архитектуры PowerPC, ARM </li><li>Опыт разработки ПО для микроконтроллеров </li><li>Опыт работы с RTOS Опыт работы с аппаратными отладчиками JTAG  </li><li>Опыт работы с сетевым оборудованием (L2/L3) либо оборудованием связи</li></ul><p>Приветствуется Ваше резюме с описанием опыта работы и, если есть, примеры кода, разработанного Вами (либо ссылка на него, если он есть в открытом доступе). </p><p> Поскольку работа сложная, а требования к соискателю высокие - перед собеседованием обязательно потребуется выполнить тестовое задание.<br /></p><p>Простите за последующий длинный текст - этот сайт перестал поддерживать ссылки на внешние ресурсы  </p><p>Тестовое задание и условия его выполнения: <br /></p><p>Тестовое задание должно быть выполнено на «голом» C под Linux. </p><p>Технологии и языки, применяемые для web|desktop (типа python и CGI) использовать нельзя. </p><p>По результатам, с одной стороны - Вы немного познакомитесь с нашими задачами, с другой стороны – мы познакомимся с Вашим стилем программирования. Прошу не стесняться обращаться, если текст задания вызывает вопросы. </p><p>Реализацию задачи и скомпилированный исполняемый файл(ы) нужно выслать мне по электронной почте; по результатам анализа - как правило, это несколько дней - либо мы договариваемся о дате/времени собеседования, либо Вы получаете отказ.</p><p>Если Вас смущает передача 100% готового кода задания, то для предварительного просмотра достаточно ~70% исходников и исполняемого файла; остальное можно принести на собеседование. </p><p>Объясню, почему так : задачи, которые будут перед Вами стоять, в случае, если мы договоримся о сотрудничестве, несколько сложнее приведённых в тесте и решать их надо будет самостоятельно. Если Вы не справляетесь с тестовым заданием – нет смысла говорить о большем. Желаю Вам успеха и надеюсь, что наша позиция будет правильно понята. </p><p>Хотя, время, затраченное Вами на реализацию тестового задания для нас в общем-то некритично и не является главным при оценке результатов, нам бы хотелось получить решение в течение двух недель.<br /></p><p>Текст тестового задания: </p><p> Два типа блоков – «control block» и «client1», «client2», …. , «clientN» соединены в одноранговую локальную сеть Ethernet. </p><p>Control block, он же блок управления, он же «мастер-контроллер»; может быть в составе сети только в одном экземпляре.</p><p>Блоки индикации, они же \"Client#\", имеются в количестве от 3 до 200.\nВсе блоки распределены в пространстве и установлены на улице. Блоки объединены локальной сетью Ethernet. Каждый блок индикации имеет 2 датчика: датчик температуры и датчик освещенности. </p><p>Мастер-контроллер в произвольные моменты времени отправляет в блоки индикации данные для отображения; например: текст, температура, время и яркость. Так же, мастер-контроллер периодически (1 раз в 5 секунд) опрашивает все датчики с блоков индикации, рассчитывает среднее значение температуры и освещенности. Среднее значение температуры используется для отправки в блоки индикации в виде текста, а среднее значение освещенности используется для подстройки яркости отображаемой информации. Мастер-контроллер устанавливает значение яркости во все блоки индикации в соответствии с расчетным средним значением освещенности.</p><p>Иногда случается так, что блок управления теряет связь с блоками индикации (как повезёт - может со всеми, а может только с частью), поэтому блоки индикации остаются без управления на время более 5 минут. В этом случае роль блока управления должен взять один из блоков индикации, до того момента пока основной блок управления снова станет доступен. Блок индикации, который взял роль мастер-контроллера, так же может потерять связь с блоками индикации (как повезёт - может со всеми, а может только с частью), после чего должен выбраться новый мастер-контроллер.</p><p>Количество блоков индикации может меняться в процессе работы.</p><p>До момента подключения к сети мастер-контроллер ничего не знает о клиентах.</p><p>Предложите и реализуйте в программе алгоритм выбора нового мастера между блоками индикации при потере соединения с блоком управления (основным блоком управления или блоком индикации, выполняющим функции мастер-контроллера). Описание алгоритма нужно представить в виде отдельного текстового файла.</p><p>Напишите программу-эмулятор блока индикации, соответствующую описанию.</p><p>Напишите программу-эмулятор блока управления, соответствующую описанию.<br /></p>"
  },
  {
    "title": "Python developer middle",
    "url": "https://ekaterinburg.superjob.ru/vakansii/python-developer-middle-46422354.html",
    "salary": 120000,
    "description": "<p>Мы - лидер в автоматизации контроля качества. Наша команда разработчиков создала гибкую, масштабируемую платформу RETAILIQA, которой пользуются компании по всей России и ближнему зарубежью. </p><p>Среди наших клиентов: МВидео, Эльдорадо, Инвитро, Татнефть, РусАгро, Аскона, Вита, Globus, DNS, Spar, Мираторг, Медси, MyBox, Рив Гош, Снежная Королева, Elis и многие другие.  <br /></p><p>Мы ищем опытного и талантливого мидл Python-разработчика. <b><br /></b></p><b>Обязанности:</b><ul><li>Разработка нового функционала, оптимизация, рефакторинг и развитие существующего кода</li><li>Участие в проектировании архитектуры программных решений.</li><li>Реализация функциональных и интеграционных тестов для обеспечения качества кода.</li></ul><b>Требования:</b><ul><li>Опыт работы с Python от 3 лет.</li><li>Знание и опыт работы с фреймворком Django.</li><li>Опыт работы с базами данных (MongoDB, MySQL).</li><li>Опыт работы с системами контроля версий (Git).</li><li>Знание и опыт работы с RESTful API.</li><li>Базовые навыки работы с Docker.</li><li>Хорошие навыки анализа и решения проблем.</li></ul><b>Мы предлагаем:</b><ul><li>Официальное трудоустройство по ТК РФ, 100% белую зарплату (оклад и премия/кварталка);</li><li>Работу в аккредитованной IT-компании</li><li>Конкурентную зарплату, зависящую от опыта и квалификации кандидата.</li><li>Гибкий график работы.</li><li>Удаленную работу или офис (Екатеринбург).</li><li>Профессиональное развитие и обучение.</li></ul>"
  },
  {
    "title": "Аналитик отдела продаж",
    "url": "https://www.superjob.ru/vakansii/analitik-otdela-prodazh-46400350.html",
    "salary": 0,
    "description": "<p>SuperJob — это инновационная IT-компания, которая помогает соискателям найти работу, а работодателям — приобрести ценного сотрудника.</p><p>Ежемесячно нашим сервисом пользуются миллионы соискателей и десятки тысяч работодателей, среди которых РЖД, Мегафон, МТС, Леруа Мерлен, Почта России, Сбербанк, Альфа-Банк, Ригла и многие другие. Мы активно развиваем нашу платформу и делаем ее лучше, подтверждая миссию «Работа должна доставлять удовольствие!»</p><p><b>Вам предстоит:</b></p><ul><li>Собирать, анализировать и консолидировать данные по продажам.</li><li>Работать с большими объемами данных.</li><li>Анализировать маркетинговые активности.</li><li>Работать с сегментацией клиентов.</li><li>Ежедневно контролировать ключевые показатели. </li><li>Тестировать гипотезы по улучшению метрик, проводить А/Б тесты и интерпретировать их результаты. </li><li>Анализировать причинно-следственную связь метрик с основными бизнес-процессами компании. Давать рекомендации по их улучшению.</li></ul><p><b>От своего будущего коллеги мы ждем:</b></p><ul><li>Продвинутого уровня использования Google analytics, Яндекс.Метрик.</li><li>Опыта работы в любой BI-системе (у нас Tableau).</li><li>Хорошего знания Excel.</li><li>Знания SQL (навыки написания сложных запросов, знание оконных функций).</li><li>Опыта работы с Python.</li></ul><p><b>Своему будущему коллеге мы предлагаем:</b></p><ul><li>Работу в одном из самых быстрорастущих рынков - HRTech.</li><li>Непрерывное профессиональное развитие внутри компании.</li><li>Возможность стать частью сплоченной команды, любящей свое дело.</li><li>Официальную заработную плату.</li><li>Современный офис в 10 минутах пешей прогулки от станций метро Пушкинская/Маяковская/Чеховская/Новослободская.</li><li>Спортивный уголок.</li><li>Комфортную зону отдыха.</li><li>Кофе-поинты с вкуснейшим кофе и вендинговым аппаратом.</li><li>Оборудованное просторное место для питания.</li><li>Оплату проезда общественным транспортом.</li></ul></p>"
  }
]
[
  {
    "title": "Junior Python разработчик",
    "url": "https://api.hh.ru/vacancies/81125618?host=hh.ru",
    "salary": 50000,
    "description": "Опыт коммерческой разработки на <highlighttext>Python</highlighttext> от 1 года. — Знание Django, Django REST Framework. — Опыт работы с Postgres. — Опыт работы с...Проектирование и разработка компонентов системы. — Корректировки backend и frontend. — Написание тестов."
  }
]
[
  {
    "title": "Педагог дополнительного образования (техническая направленность)",
    "url": "https://spb.superjob.ru/vakansii/pedagog-dopolnitelnogo-obrazovaniya-44483292.html",
    "salary": 0,
    "description": "<b>Обязанности:</b><ul><li>Ведение программ Программирование роботов или Программирование на Java или Кибергигиена в отделении дополнительного образования детей, ЦЦО Инфинити</li><li>Возможно трудоустройство по другим (вашим) программам технической направленности<br /></li></ul><b>Требования:</b><ul><li>Высшее образование, возможно трудоустройство студентов последних курсов<br /></li></ul><b>Условия:</b><ul><li>Гибкий удобный график</li><li>Заработная плата зависит от нагрузки (нагрузку предложим в любом объеме)<br /></li></ul>"
  },
  {
    "title": "Главный специалист Отдела программой эксплуатации",
    "url": "https://izhevsk.superjob.ru/vakansii/glavnyj-specialist-otdela-programmoj-ekspluatacii-43163788.html",
    "salary": 50000,
    "description": "<p><b>Обязанности:</b></p><p>- Описание процессов и сценариев работы информационных систем;</p><p>- Подготовка технических регламентов по работе с программными продуктами;</p><p>- Создание технической документации;</p><p>- Участие в функциональном и интеграционном тестировании и приемо-сдаточных испытаниях;</p><p>- Аудит баз данных информационной системы СФР (проверка, сверка, сравнительный анализ БД);</p><p>- Разработка программного обеспечения на Python, PHP, HTML, java-script, SQL, java;</p><p>- Техническая поддержка пользователей</p><p><b>Требования:</b></p><p>Высшее профильное образование;</p><p>Знание и опыт администрирования современных операционных систем от 3 лет, в том числе Linux-систем (в приоритете - RedHat);</p><p>Знание языков программирования, в приоритете Python, PHP</p><p>Работа с БД, знание SQL</p><p>Уверенные знания продуктов  MS Office (в особенности Excel на уровне чтения/написания макросов на VBA, формул и работа со сводными таблицами, а так же PowerPoint)</p><p>Аналитический склад ума и высокая скорость мышления</p><p>Умение анализировать запросы в базах, готовить письменные критические замечания для дальнейшей оптимизации структуры соответствующих баз данных и используемых запросов</p><p>Просьба: резюме направлять на почту Кузьминой Светлане</p><p><b>Условия:</b></p><p>- стабильная зарплата (2 раза в месяц) + премии;</p><p>- оформление, отпуск, больничный и пр. - по ТК РФ;</p><p>- дополнительный ежегодный отпуск в количестве 10 дней;</p><p>- возможность быстрого профессионального и карьерного роста;</p><p>- отличная материальная база для профессионального развития;</p><p>- возможность обучения за счет работодателя.</p>"
  },
  {
    "title": "Учитель по программированию",
    "url": "https://andreevka.superjob.ru/vakansii/uchitel-po-programmirovaniyu-45698480.html",
    "salary": 0,
    "description": "<b>Обязанности:</b><ul><li><p>Обучение детей (4-14 лет) в группах программированию     </p></li><li><p>Формирование у учеников логического системного мышления и развитие технических творческих способностей  <br /></p></li><li>Обучение детей основам проектной работы в IT</li><li>\nПоддержание интереса и мотивации учеников\n\n  </li></ul><b>Требования:</b><ul><li><p>Опыт работы с детьми (аниматор, репетитор, воспитатель, вожатый,\nучитель, опытный родитель или старший брат/сестра</p></li><li>Уверенное владение компьютером. В идеале, знание основ алгоритмического языка и программирования. (Предпочтительно: Scratch JR, Scratch, Snap, Stencyl, Tynker, Blockly, Перволого, Пиктомир)</li><li>Умение объяснять сложное простыми (иногда детскими) словами\n\n</li><li>Любовь к детям и умение направить их энергию в нужное русло  <br /></li><li>Знание текстовых языков программирования Python, Java и прочее - желательно  <br /></li></ul><b>Условия:</b><ul><li><p>Удобный график (очень многое можно скорректировать совместно с\nадминистратором) </p></li><li>Возможность обучать мотивированных детей, которые стремятся узнать все о современных технологиях и не только  </li><li>Увлеченная команда преподавателей  <br /></li><li> Интересные и амбициозные задачи</li><li> Профессия квалифицированного детского IT тренера - одна из самых востребованных на рынке труда\n\n <br /></li></ul>"
  },
  {
    "title": "Ведущий Java-разработчик (Команда ДКБ CRM)",
    "url": "https://ekaterinburg.superjob.ru/vakansii/veduschij-java-razrabotchik-45706493.html",
    "salary": 0,
    "description": "<p>Ищем талантливого Java-разработчика для работы над задачами команды ДКБ CRM.</p><p>В работе используем стек технологий и инструменты: Java 11,14, Spring Framework 5, Hibernate Oracle, PostgreSQL, Mockito, Jenkins, Tomcat, Kafka.</p><p>Методология разработки - \"Scrumban\".</p><p>В команде есть владелец продукта, техлид, тимлид, аналитики, разработчики, скрам-мастер.</p><p>Что предстоит:</p><ul><li>Разработка архитектуры и самого решения для backend части приложения;</li><li>Проектирование и разработка интерфейсов приложений/ключевых технологических и прикладных микросервисов платформы;</li><li>Внедрять новые фичи - мы активно работаем с фидбеком клиентов и постоянно улучшаем наши продукты</li><li>Оптимизировать скорость работы приложений (куда без этого);</li><li>Взаимодействие с разработчиками, аналитиками, дизайнерами и другими командами</li></ul><p>Нам нужен человек, который:</p><ul><li>Высшее техническое, математическое или другое профильное образование (в том числе курсы повышения квалификации) в сфере ИТ;</li><li>Java SE 8 или выше, Spring Framework 5, принципы SOLID;</li><li>Знание паттернов проектирования;</li><li>Знание методологии TDD и понимание, как правильно писать тесты (модульные, интеграционные);</li></ul><p>Будет плюсом:</p><ul><li>Опыт разработки на Groovy.</li><li>Опыт разработки Enterprise приложений;</li><li>Знание шаблона проектирования Domain-Driven Design;</li><li>Умение писать SQL запросы.</li></ul><p>Мы предлагаем:</p><ul><li>Гибкий график и удаленный формат;</li><li>Развитие внутри команды, регулярные code review;</li><li>Уровень ЗП обсуждаем индивидуально (ожидания+скиллы), все белое, полное соблюдение ТК РФ;</li><li>ДМС + стоматология;</li><li>Наши сотрудники имеют возможность оформить льготные кредиты и ипотеку;</li><li>Увлекательную корпоративную жизнь и даже удаленно.</li></ul>"
  },
  {
    "title": "Ведущий Java-разработчик",
    "url": "https://ekaterinburg.superjob.ru/vakansii/veduschij-java-razrabotchik-45706574.html",
    "salary": 0,
    "description": "<p>Ищем талантливого Java-разработчика для работы над задачами команды ДКБ CRM.</p><p>В работе используем стек технологий и инструменты: Java 11,14, Spring Framework 5, Hibernate Oracle, PostgreSQL, Mockito, Jenkins, Tomcat, Kafka.</p><p>Методология разработки - \"Scrumban\".</p><p>В команде есть владелец продукта, техлид, тимлид, аналитики, разработчики, скрам-мастер.</p><p>Что предстоит:</p><ul><li>Разработка архитектуры и самого решения для backend части приложения;</li><li>Проектирование и разработка интерфейсов приложений/ключевых технологических и прикладных микросервисов платформы;</li><li>Внедрять новые фичи - мы активно работаем с фидбеком клиентов и постоянно улучшаем наши продукты</li><li>Оптимизировать скорость работы приложений (куда без этого);</li><li>Взаимодействие с разработчиками, аналитиками, дизайнерами и другими командами</li></ul><p>Нам нужен человек, который:</p><ul><li>Высшее техническое, математическое или другое профильное образование (в том числе курсы повышения квалификации) в сфере ИТ;</li><li>Java SE 8 или выше, Spring Framework 5, принципы SOLID;</li><li>Знание паттернов проектирования;</li><li>Знание методологии TDD и понимание, как правильно писать тесты (модульные, интеграционные);</li></ul><p>Будет плюсом:</p><ul><li>Опыт разработки на Groovy.</li><li>Опыт разработки Enterprise приложений;</li><li>Знание шаблона проектирования Domain-Driven Design;</li><li>Умение писать SQL запросы.</li></ul><p>Мы предлагаем:</p><ul><li>Гибкий график и удаленный формат;</li><li>Развитие внутри команды, регулярные code review;</li><li>Уровень ЗП обсуждаем индивидуально (ожидания+скиллы), все белое, полное соблюдение ТК РФ;</li><li>ДМС + стоматология;</li><li>Наши сотрудники имеют возможность оформить льготные кредиты и ипотеку;</li><li>Увлекательную корпоративную жизнь и даже удаленно.</li></ul>"
  },
  {
    "title": "Ведущий Java-разработчик",
    "url": "https://www.superjob.ru/vakansii/veduschij-java-razrabotchik-45706575.html",
    "salary": 0,
    "description": "<p>Ищем талантливого Java-разработчика для работы над задачами команды ДКБ CRM.</p><p>В работе используем стек технологий и инструменты: Java 14, Spring Framework 5, Hibernate Oracle, PostgreSQL, Mockito, Jenkins, Tomcat, Kafka.</p><p>Методология разработки - \"Scrumban\".</p><p>В команде есть владелец продукта, техлид, тимлид, аналитики, разработчики, скрам-мастер.</p><p>Что предстоит:</p><ul><li>Разработка архитектуры и самого решения для backend части приложения;</li><li>Проектирование и разработка интерфейсов приложений/ключевых технологических и прикладных микросервисов платформы;</li><li>Внедрять новые фичи - мы активно работаем с фидбеком клиентов и постоянно улучшаем наши продукты</li><li>Оптимизировать скорость работы приложений (куда без этого);</li><li>Взаимодействие с разработчиками, аналитиками, дизайнерами и другими командами</li></ul><p>Нам нужен человек, который:</p><ul><li>Высшее техническое, математическое или другое профильное образование (в том числе курсы повышения квалификации) в сфере ИТ;</li><li>Java SE 8 или выше, Spring Framework 5, принципы SOLID;</li><li>Знание паттернов проектирования;</li><li>Знание методологии TDD и понимание, как правильно писать тесты (модульные, интеграционные);</li></ul><p>Будет плюсом:</p><ul><li>Опыт разработки на Groovy.</li><li>Опыт разработки Enterprise приложений;</li><li>Знание шаблона проектирования Domain-Driven Design;</li><li>Умение писать SQL запросы.</li></ul><p>Мы предлагаем:</p><ul><li>Гибкий график и удаленный формат;</li><li>Развитие внутри команды, регулярные code review;</li><li>Уровень ЗП обсуждаем индивидуально (ожидания+скиллы), все белое, полное соблюдение ТК РФ;</li><li>ДМС + стоматология;</li><li>Наши сотрудники имеют возможность оформить льготные кредиты и ипотеку;</li><li>Увлекательную корпоративную жизнь и даже удаленно.</li></ul>"
  },
  {
    "title": "Преподаватель информатики (программирования на языке Java)",
    "url": "https://spb.superjob.ru/vakansii/prepodavatel-informatiki-46400841.html",
    "salary": 40000,
    "description": "<b>Обязанности:</b><ul><li>Преподавание учебных дисциплин;</li><li>Организация учебной деятельности обучающихся по освоению учебных дисциплин;</li><li>Педагогический контроль и оценка освоения образовательной программы в процессе промежуточной и итоговой аттестации;</li><li>Разработка программно-методического обеспечения учебных дисциплин</li><li>Обучение студентов специальности 09.02.07 — Информационные системы и программирование</li></ul><b>Требования:</b><ul><li>Высшее профильное образование</li><li>опыт работы от 1 года</li><li>Программирования на языке Java</li></ul><b>Условия:</b><ul><li>6-ти дневная рабочая неделя, ежегодный оплачиваемый отпуск 56 дней</li><li>Преподаватель требуется с 1 сентября 2023 г.</li></ul>"
  },
  {
    "title": "Учитель информатики, робототехники (на 2023-24 учебный год)",
    "url": "https://www.superjob.ru/vakansii/uchitel-informatiki-37611505.html",
    "salary": 80000,
    "description": "<b>Обязанности:</b><ul><li>Осуществляет обучение и воспитание обучающихся с учетом специфики преподаваемого предмета, проводит уроки и другие занятия в соответствии с расписанием в указанных помещениях.</li><li>Составляет тематический план работы по предмету в каждой параллели классов (с 1 по 11 класс) на учебный триместр и рабочий план на каждый урок.</li><li>В своей работе по предмету использует разнообразные приемы, методы и средства обучения.</li><li>Реализует образовательные программы.</li><li>Может переставлять по своему усмотрению темы уроков в отдельных разделах программы.</li><li>Обучение информатике и ИТ в соответствии с требованиями ФГОС. </li><li>Подготовка к ГИА . </li><li>Работа с разноуровневыми группами (по степени мотивации, успеваемости).</li><li>Организация внеурочной деятельности по предмету.  </li></ul><b>Требования:</b><ul><li>\nВысшее педагогическое образование. </li><li>Умение работать с системой электронного журнала (на базе ЭлЖур).</li><li>Умение работать с  сайтом образовательного учреждения (на базе Tilda).</li><li>Программирование: Перволого/Логомиры, Scratch, Кумир, Паскаль/Дельфи, Alice/Greenfoot/Java, C/C++</li><li>Администрирование: Windows, Linux, Cisco</li></ul><b>Условия:</b><ul><li> Оформление по ТК РФ. \nПолный рабочий день.  Варианты нагрузки - на собеседовании.\n\n\n </li><li> Дружный коллектив.  На территории работодателя. </li><li>Обязательно наличие медицинской книжки, справка об отсутствии о судимости.  \n\n   </li></ul>"
  },
  {
    "title": "Руководитель группы прикладной разработки (техлид)",
    "url": "https://www.superjob.ru/vakansii/rukovoditel-gruppy-prikladnoj-razrabotki-46199522.html",
    "salary": 0,
    "description": "<p><b>Обязанности:</b></p><ul><li>Определение оптимальных технологий для реализации текущих задач;</li><li>Разработка архитектуры прикладных информационных систем;</li><li>Написание программного кода на языках Java и Kotlin с использованием лучших практик и актуальных фреймворков;</li><li>Координация процесса разработки в части написания программного кода и отладки, доведение принятых принципов и архитектурных решений до других программистов (включая подрядчиков), а также проведение код-ревью;</li><li>Оформление технической документации по программным решениям. </li></ul><b>Требования:</b><ul><li>Высшее техническое образование;</li><li>Не менее 5 лет в сфере разработки программного обеспечения;</li><li>Уверенное знание Java 17+ и Kotlin 1.7, владение фреймворком Spring 5 и 6 версии (включая его экосистему – Spring Boot, Security, JPA и т.п.);</li><li>Уверенное знание SQL (преимущественно PostgreSQL) и способов использования баз данных в экосистеме Java – JDBC, Hibernate;</li><li>Понимание принципов микросервисной архитектуры, опыт внедрения и использования средств мессаджинга (Apache Kafka);</li><li>Уверенное знание средств разработки (IntelliJ IDEA, GitLab) и опыт работы с ПО для организации процесса разработки (Jira, Confluence);</li><li>Коммуникабельность (умение четко формулировать мысли, доносить их до подчиненных и решать возникающие недопонимания).</li><li>Будет преимуществом:</li><li>Опыт работы с JavaScript/TypeScript, в частности, с фронтенд-фреймворком Vue3;</li><li>Наличие собственной лицензии на IntelliJ IDEA;</li><li>Опыт работы с шаблонизатором Thymeleaf;</li><li>Опыт работы с Groovy;</li><li>Опыт работы в руководящих должностях в сфере IT.</li></ul><b>Условия:</b><ul><li>Оформление по ТК РФ, заработная плата полностью «белая» и выплачивается в срок;</li><li>Оборудованное рабочее место в главном здании Университета у ст.м. «Тропарево», «Юго-Западная», «Коньково»;</li><li>Очная форма работы с обсуждаемым графиком и присутствием;</li><li>Бронирование от призыва в порядке, установленном законодательством. </li></ul>"
  },
  {
    "title": "Android-разработчик",
    "url": "https://www.superjob.ru/vakansii/android-razrabotchik-46409492.html",
    "salary": 0,
    "description": "SuperJob — это инновационная IT-компания, которая помогает соискателям найти работу, а работодателям — приобрести ценного сотрудника. Ежемесячно нашим сервисом пользуются миллионы соискателей и десятки тысяч работодателей, среди которых РЖД, Мегафон, МТС, Леруа Мерлен, Почта России, Сбербанк, Альфа-Банк, Ригла и многие другие. Мы активно развиваем нашу платформу и делаем ее лучше, подтверждая миссию «Работа должна доставлять удовольствие!»<br /><p><br /></p><p>Мы ищем старшего или ведущего разработчика в нашу команду Android-разработки, которая работает над 3 приложениями с более 400 000 активных установок.</p><p>Мы ценим вовлечённость и проактивность, разработчики привлекаются ко всему циклу работы над задачей: от проработки идеи до релиза на продакшн. </p><p><b>Стек технологий:</b></p><ul><li>Gradle multi-project: 100+ модулей. Демоаппы для быстрой пересборки фичеэкранов, используем свои темплейты студии для их генерации.</li><li>Для всей новой функциональности и тестов используется Kotlin, 60% кодовой базы на Kotlin.</li><li>Фиче-модули на MVVM, Android Jetpack, Jetpack Compose.</li><li>Используем Retrofit 2 / OkHttp, Yatagan для DI, Moshi для сериализации/десериализации JSON, Room Persistence Library для работы с БД, Firebase, Huawei Play Services.</li><li>Для написания фичей следуем Clean Architecture с использованием корутин.</li><li>CI настроен на TeamCity: сборки — на каждый на PR, релиз — каждые две недели.</li><li>Во всём остальном используем стек Atlassian (Jira, Bitbucket, Confluence).</li><li>Для общения — Rocket Chat, который  интегрирован с остальными системами: сами пишем скрипты интеграции (например, оповещения в командные чаты о новых ревью, оповещения от TeamCity насчет релизов и прохождения тестов и т.д.).</li></ul><p><b>Чем предстоит заниматься:</b></p><ul><li>Проектировать архитектуру приложений и клиент-серверное взаимодействие.</li><li>Писать качественный, поддерживаемый и тестируемый код на Kotlin.</li><li>Рефакторить старые фичи на новую архитектуру c Java на Kotlin.</li><li>Самостоятельно декомпозировать задачи.</li><li>Взаимодействовать с дизайнерами, менеджерами проектов и продуктов, разработчиками, аналитиками и тестировщиками.</li><li>Принимать участие в разработке всех приложений. Можно выбирать и технические задачи, и заниматься UI.</li><li>Релизиться каждые 2 недели.</li></ul><p><b>От вас мы ждём:</b></p><ul><li>Опыта коммерческой разработки нативных приложений под Android.</li><li>Опыта командной разработки.</li><li>Опыт работы с Kotlin.</li><li>Опыт работы с корутинами и Flow.</li><li>Опыт работы с RxJava 2 для рефакторинга старых фичей на корутины.</li><li>Опыта работы с Jetpack Compose.</li></ul><p><b>Своему будущему коллеге мы предлагаем:</b><br /></p><ul><li>Работу в одном из самых быстрорастущих рынков - HRTech.</li><li>Высокую инженерную культуру.</li><li>Непрерывное профессиональное развитие внутри компании.</li><li>Возможность стать частью сплоченной команды, любящей свое дело.</li><li>Официальную заработную плату.</li><li>Современный офис в 10 минутах пешей прогулки от станций метро Пушкинская/Маяковская/Чеховская/Новослободская.</li><li>Спортивный уголок.</li><li>Комфортную зону отдыха.</li><li>Кофе-поинты с вкуснейшим кофе и вендинговым аппаратом.</li><li>Оборудованное просторное место для питания.</li></ul>"
  }
]
[
  {
    "title": "Junior java-разработчик",
    "url": "https://api.hh.ru/vacancies/81065602?host=hh.ru",
    "salary": 50000,
    "description": "Наличие пройдённых профильных курсов, пет-проектов или опыт работы младшим разработчиком. Знание <highlighttext>Java</highlighttext> 8+, Spring (Spring Boot, Spring Data). Участие в разработке компонентов платформы. Участие в рефакторинге платформы. Участие в реализации задач технического долга и отложенного бэклога. "
  }
]
